zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/include/pio/pic32cm6408pl10048.h
/*
 * Peripheral I/O description for pic32cm6408pl10048
 *
 * Copyright (c) 2026 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*      file generated from device description file (ATDF) version None       */
#ifndef _pic32cm6408pl10048_GPIO_H_
#define _pic32cm6408pl10048_GPIO_H_

/* ======================= Peripheral I/O pin numbers ======================= */
#define PIN_PA00                    (    0)  /* Pin Number for PA00 */
#define PIN_PA01                    (    1)  /* Pin Number for PA01 */
#define PIN_PA02                    (    2)  /* Pin Number for PA02 */
#define PIN_PA03                    (    3)  /* Pin Number for PA03 */
#define PIN_PA04                    (    4)  /* Pin Number for PA04 */
#define PIN_PA05                    (    5)  /* Pin Number for PA05 */
#define PIN_PA06                    (    6)  /* Pin Number for PA06 */
#define PIN_PA07                    (    7)  /* Pin Number for PA07 */
#define PIN_PA08                    (    8)  /* Pin Number for PA08 */
#define PIN_PA09                    (    9)  /* Pin Number for PA09 */
#define PIN_PA10                    (   10)  /* Pin Number for PA10 */
#define PIN_PA11                    (   11)  /* Pin Number for PA11 */
#define PIN_PA12                    (   12)  /* Pin Number for PA12 */
#define PIN_PA13                    (   13)  /* Pin Number for PA13 */
#define PIN_PA14                    (   14)  /* Pin Number for PA14 */
#define PIN_PA15                    (   15)  /* Pin Number for PA15 */
#define PIN_PA16                    (   16)  /* Pin Number for PA16 */
#define PIN_PA17                    (   17)  /* Pin Number for PA17 */
#define PIN_PA18                    (   18)  /* Pin Number for PA18 */
#define PIN_PA19                    (   19)  /* Pin Number for PA19 */
#define PIN_PA20                    (   20)  /* Pin Number for PA20 */
#define PIN_PA21                    (   21)  /* Pin Number for PA21 */
#define PIN_PA22                    (   22)  /* Pin Number for PA22 */
#define PIN_PA23                    (   23)  /* Pin Number for PA23 */
#define PIN_PA24                    (   24)  /* Pin Number for PA24 */
#define PIN_PA25                    (   25)  /* Pin Number for PA25 */
#define PIN_PA26                    (   26)  /* Pin Number for PA26 */
#define PIN_PA27                    (   27)  /* Pin Number for PA27 */
#define PIN_PA28                    (   28)  /* Pin Number for PA28 */
#define PIN_PA29                    (   29)  /* Pin Number for PA29 */
#define PIN_PA30                    (   30)  /* Pin Number for PA30 */
#define PIN_PA31                    (   31)  /* Pin Number for PA31 */
#define PIN_PB00                    (   32)  /* Pin Number for PB00 */
#define PIN_PB01                    (   33)  /* Pin Number for PB01 */
#define PIN_PB02                    (   34)  /* Pin Number for PB02 */
#define PIN_PB03                    (   35)  /* Pin Number for PB03 */
#define PIN_PB04                    (   36)  /* Pin Number for PB04 */
#define PIN_PB05                    (   37)  /* Pin Number for PB05 */
#define PIN_PB08                    (   40)  /* Pin Number for PB08 */
#define PIN_PB09                    (   41)  /* Pin Number for PB09 */
#define PIN_PB10                    (   42)  /* Pin Number for PB10 */
#define PIN_PB11                    (   43)  /* Pin Number for PB11 */

/* ========================== Peripheral I/O masks ========================== */
#define PORT_PA00                   (_UINT32_(1) << 0) /* PORT mask for PA00 */
#define PORT_PA01                   (_UINT32_(1) << 1) /* PORT mask for PA01 */
#define PORT_PA02                   (_UINT32_(1) << 2) /* PORT mask for PA02 */
#define PORT_PA03                   (_UINT32_(1) << 3) /* PORT mask for PA03 */
#define PORT_PA04                   (_UINT32_(1) << 4) /* PORT mask for PA04 */
#define PORT_PA05                   (_UINT32_(1) << 5) /* PORT mask for PA05 */
#define PORT_PA06                   (_UINT32_(1) << 6) /* PORT mask for PA06 */
#define PORT_PA07                   (_UINT32_(1) << 7) /* PORT mask for PA07 */
#define PORT_PA08                   (_UINT32_(1) << 8) /* PORT mask for PA08 */
#define PORT_PA09                   (_UINT32_(1) << 9) /* PORT mask for PA09 */
#define PORT_PA10                   (_UINT32_(1) << 10) /* PORT mask for PA10 */
#define PORT_PA11                   (_UINT32_(1) << 11) /* PORT mask for PA11 */
#define PORT_PA12                   (_UINT32_(1) << 12) /* PORT mask for PA12 */
#define PORT_PA13                   (_UINT32_(1) << 13) /* PORT mask for PA13 */
#define PORT_PA14                   (_UINT32_(1) << 14) /* PORT mask for PA14 */
#define PORT_PA15                   (_UINT32_(1) << 15) /* PORT mask for PA15 */
#define PORT_PA16                   (_UINT32_(1) << 16) /* PORT mask for PA16 */
#define PORT_PA17                   (_UINT32_(1) << 17) /* PORT mask for PA17 */
#define PORT_PA18                   (_UINT32_(1) << 18) /* PORT mask for PA18 */
#define PORT_PA19                   (_UINT32_(1) << 19) /* PORT mask for PA19 */
#define PORT_PA20                   (_UINT32_(1) << 20) /* PORT mask for PA20 */
#define PORT_PA21                   (_UINT32_(1) << 21) /* PORT mask for PA21 */
#define PORT_PA22                   (_UINT32_(1) << 22) /* PORT mask for PA22 */
#define PORT_PA23                   (_UINT32_(1) << 23) /* PORT mask for PA23 */
#define PORT_PA24                   (_UINT32_(1) << 24) /* PORT mask for PA24 */
#define PORT_PA25                   (_UINT32_(1) << 25) /* PORT mask for PA25 */
#define PORT_PA26                   (_UINT32_(1) << 26) /* PORT mask for PA26 */
#define PORT_PA27                   (_UINT32_(1) << 27) /* PORT mask for PA27 */
#define PORT_PA28                   (_UINT32_(1) << 28) /* PORT mask for PA28 */
#define PORT_PA29                   (_UINT32_(1) << 29) /* PORT mask for PA29 */
#define PORT_PA30                   (_UINT32_(1) << 30) /* PORT mask for PA30 */
#define PORT_PA31                   (_UINT32_(1) << 31) /* PORT mask for PA31 */
#define PORT_PB00                   (_UINT32_(1) << 0) /* PORT mask for PB00 */
#define PORT_PB01                   (_UINT32_(1) << 1) /* PORT mask for PB01 */
#define PORT_PB02                   (_UINT32_(1) << 2) /* PORT mask for PB02 */
#define PORT_PB03                   (_UINT32_(1) << 3) /* PORT mask for PB03 */
#define PORT_PB04                   (_UINT32_(1) << 4) /* PORT mask for PB04 */
#define PORT_PB05                   (_UINT32_(1) << 5) /* PORT mask for PB05 */
#define PORT_PB08                   (_UINT32_(1) << 8) /* PORT mask for PB08 */
#define PORT_PB09                   (_UINT32_(1) << 9) /* PORT mask for PB09 */
#define PORT_PB10                   (_UINT32_(1) << 10) /* PORT mask for PB10 */
#define PORT_PB11                   (_UINT32_(1) << 11) /* PORT mask for PB11 */

/* =================== PORT definition for AC peripheral ==================== */
#define PIN_PA19B_AC_AC0N0                         _UINT32_(19)
#define MUX_PA19B_AC_AC0N0                         _UINT32_(1) 
#define PINMUX_PA19B_AC_AC0N0                      ((PIN_PA19B_AC_AC0N0 << 16) | MUX_PA19B_AC_AC0N0)
#define PORT_PA19B_AC_AC0N0                        (_UINT32_(1) << 19)

#define PIN_PA16B_AC_AC0N1                         _UINT32_(16)
#define MUX_PA16B_AC_AC0N1                         _UINT32_(1) 
#define PINMUX_PA16B_AC_AC0N1                      ((PIN_PA16B_AC_AC0N1 << 16) | MUX_PA16B_AC_AC0N1)
#define PORT_PA16B_AC_AC0N1                        (_UINT32_(1) << 16)

#define PIN_PA23B_AC_AC0N2                         _UINT32_(23)
#define MUX_PA23B_AC_AC0N2                         _UINT32_(1) 
#define PINMUX_PA23B_AC_AC0N2                      ((PIN_PA23B_AC_AC0N2 << 16) | MUX_PA23B_AC_AC0N2)
#define PORT_PA23B_AC_AC0N2                        (_UINT32_(1) << 23)

#define PIN_PA18B_AC_AC0P0                         _UINT32_(18)
#define MUX_PA18B_AC_AC0P0                         _UINT32_(1) 
#define PINMUX_PA18B_AC_AC0P0                      ((PIN_PA18B_AC_AC0P0 << 16) | MUX_PA18B_AC_AC0P0)
#define PORT_PA18B_AC_AC0P0                        (_UINT32_(1) << 18)

#define PIN_PB08B_AC_AC0P1                         _UINT32_(40)
#define MUX_PB08B_AC_AC0P1                         _UINT32_(1) 
#define PINMUX_PB08B_AC_AC0P1                      ((PIN_PB08B_AC_AC0P1 << 16) | MUX_PB08B_AC_AC0P1)
#define PORT_PB08B_AC_AC0P1                        (_UINT32_(1) << 8)

#define PIN_PB10B_AC_AC0P2                         _UINT32_(42)
#define MUX_PB10B_AC_AC0P2                         _UINT32_(1) 
#define PINMUX_PB10B_AC_AC0P2                      ((PIN_PB10B_AC_AC0P2 << 16) | MUX_PB10B_AC_AC0P2)
#define PORT_PB10B_AC_AC0P2                        (_UINT32_(1) << 10)

#define PIN_PA22B_AC_AC0P3                         _UINT32_(22)
#define MUX_PA22B_AC_AC0P3                         _UINT32_(1) 
#define PINMUX_PA22B_AC_AC0P3                      ((PIN_PA22B_AC_AC0P3 << 16) | MUX_PA22B_AC_AC0P3)
#define PORT_PA22B_AC_AC0P3                        (_UINT32_(1) << 22)

#define PIN_PA20B_AC_AC0P5                         _UINT32_(20)
#define MUX_PA20B_AC_AC0P5                         _UINT32_(1) 
#define PINMUX_PA20B_AC_AC0P5                      ((PIN_PA20B_AC_AC0P5 << 16) | MUX_PA20B_AC_AC0P5)
#define PORT_PA20B_AC_AC0P5                        (_UINT32_(1) << 20)

#define PIN_PA21B_AC_AC0P6                         _UINT32_(21)
#define MUX_PA21B_AC_AC0P6                         _UINT32_(1) 
#define PINMUX_PA21B_AC_AC0P6                      ((PIN_PA21B_AC_AC0P6 << 16) | MUX_PA21B_AC_AC0P6)
#define PORT_PA21B_AC_AC0P6                        (_UINT32_(1) << 21)

#define PIN_PA21B_AC_AC1N0                         _UINT32_(21)
#define MUX_PA21B_AC_AC1N0                         _UINT32_(1) 
#define PINMUX_PA21B_AC_AC1N0                      ((PIN_PA21B_AC_AC1N0 << 16) | MUX_PA21B_AC_AC1N0)
#define PORT_PA21B_AC_AC1N0                        (_UINT32_(1) << 21)

#define PIN_PA16B_AC_AC1N1                         _UINT32_(16)
#define MUX_PA16B_AC_AC1N1                         _UINT32_(1) 
#define PINMUX_PA16B_AC_AC1N1                      ((PIN_PA16B_AC_AC1N1 << 16) | MUX_PA16B_AC_AC1N1)
#define PORT_PA16B_AC_AC1N1                        (_UINT32_(1) << 16)

#define PIN_PA23B_AC_AC1N2                         _UINT32_(23)
#define MUX_PA23B_AC_AC1N2                         _UINT32_(1) 
#define PINMUX_PA23B_AC_AC1N2                      ((PIN_PA23B_AC_AC1N2 << 16) | MUX_PA23B_AC_AC1N2)
#define PORT_PA23B_AC_AC1N2                        (_UINT32_(1) << 23)

#define PIN_PA18B_AC_AC1P0                         _UINT32_(18)
#define MUX_PA18B_AC_AC1P0                         _UINT32_(1) 
#define PINMUX_PA18B_AC_AC1P0                      ((PIN_PA18B_AC_AC1P0 << 16) | MUX_PA18B_AC_AC1P0)
#define PORT_PA18B_AC_AC1P0                        (_UINT32_(1) << 18)

#define PIN_PA19B_AC_AC1P1                         _UINT32_(19)
#define MUX_PA19B_AC_AC1P1                         _UINT32_(1) 
#define PINMUX_PA19B_AC_AC1P1                      ((PIN_PA19B_AC_AC1P1 << 16) | MUX_PA19B_AC_AC1P1)
#define PORT_PA19B_AC_AC1P1                        (_UINT32_(1) << 19)

