zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/include/pio/pic32cm6408pl10048.h
#define PIN_PA20B_AC_AC1P2                         _UINT32_(20)
#define MUX_PA20B_AC_AC1P2                         _UINT32_(1) 
#define PINMUX_PA20B_AC_AC1P2                      ((PIN_PA20B_AC_AC1P2 << 16) | MUX_PA20B_AC_AC1P2)
#define PORT_PA20B_AC_AC1P2                        (_UINT32_(1) << 20)

#define PIN_PA22B_AC_AC1P3                         _UINT32_(22)
#define MUX_PA22B_AC_AC1P3                         _UINT32_(1) 
#define PINMUX_PA22B_AC_AC1P3                      ((PIN_PA22B_AC_AC1P3 << 16) | MUX_PA22B_AC_AC1P3)
#define PORT_PA22B_AC_AC1P3                        (_UINT32_(1) << 22)

#define PIN_PA21B_AC_AC1P5                         _UINT32_(21)
#define MUX_PA21B_AC_AC1P5                         _UINT32_(1) 
#define PINMUX_PA21B_AC_AC1P5                      ((PIN_PA21B_AC_AC1P5 << 16) | MUX_PA21B_AC_AC1P5)
#define PORT_PA21B_AC_AC1P5                        (_UINT32_(1) << 21)

#define PIN_PA07H_AC_CMP0                          _UINT32_(7) 
#define MUX_PA07H_AC_CMP0                          _UINT32_(7) 
#define PINMUX_PA07H_AC_CMP0                       ((PIN_PA07H_AC_CMP0 << 16) | MUX_PA07H_AC_CMP0)
#define PORT_PA07H_AC_CMP0                         (_UINT32_(1) << 7)

#define PIN_PA15H_AC_CMP0                          _UINT32_(15)
#define MUX_PA15H_AC_CMP0                          _UINT32_(7) 
#define PINMUX_PA15H_AC_CMP0                       ((PIN_PA15H_AC_CMP0 << 16) | MUX_PA15H_AC_CMP0)
#define PORT_PA15H_AC_CMP0                         (_UINT32_(1) << 15)

#define PIN_PA05H_AC_CMP1                          _UINT32_(5) 
#define MUX_PA05H_AC_CMP1                          _UINT32_(7) 
#define PINMUX_PA05H_AC_CMP1                       ((PIN_PA05H_AC_CMP1 << 16) | MUX_PA05H_AC_CMP1)
#define PORT_PA05H_AC_CMP1                         (_UINT32_(1) << 5)

#define PIN_PA13H_AC_CMP1                          _UINT32_(13)
#define MUX_PA13H_AC_CMP1                          _UINT32_(7) 
#define PINMUX_PA13H_AC_CMP1                       ((PIN_PA13H_AC_CMP1 << 16) | MUX_PA13H_AC_CMP1)
#define PORT_PA13H_AC_CMP1                         (_UINT32_(1) << 13)

/* ================== PORT definition for ADC0 peripheral =================== */
#define PIN_PA02B_ADC0_AIN2                        _UINT32_(2) 
#define MUX_PA02B_ADC0_AIN2                        _UINT32_(1) 
#define PINMUX_PA02B_ADC0_AIN2                     ((PIN_PA02B_ADC0_AIN2 << 16) | MUX_PA02B_ADC0_AIN2)
#define PORT_PA02B_ADC0_AIN2                       (_UINT32_(1) << 2)

#define PIN_PA03B_ADC0_AIN3                        _UINT32_(3) 
#define MUX_PA03B_ADC0_AIN3                        _UINT32_(1) 
#define PINMUX_PA03B_ADC0_AIN3                     ((PIN_PA03B_ADC0_AIN3 << 16) | MUX_PA03B_ADC0_AIN3)
#define PORT_PA03B_ADC0_AIN3                       (_UINT32_(1) << 3)

#define PIN_PA04B_ADC0_AIN4                        _UINT32_(4) 
#define MUX_PA04B_ADC0_AIN4                        _UINT32_(1) 
#define PINMUX_PA04B_ADC0_AIN4                     ((PIN_PA04B_ADC0_AIN4 << 16) | MUX_PA04B_ADC0_AIN4)
#define PORT_PA04B_ADC0_AIN4                       (_UINT32_(1) << 4)

#define PIN_PA05B_ADC0_AIN5                        _UINT32_(5) 
#define MUX_PA05B_ADC0_AIN5                        _UINT32_(1) 
#define PINMUX_PA05B_ADC0_AIN5                     ((PIN_PA05B_ADC0_AIN5 << 16) | MUX_PA05B_ADC0_AIN5)
#define PORT_PA05B_ADC0_AIN5                       (_UINT32_(1) << 5)

#define PIN_PA06B_ADC0_AIN6                        _UINT32_(6) 
#define MUX_PA06B_ADC0_AIN6                        _UINT32_(1) 
#define PINMUX_PA06B_ADC0_AIN6                     ((PIN_PA06B_ADC0_AIN6 << 16) | MUX_PA06B_ADC0_AIN6)
#define PORT_PA06B_ADC0_AIN6                       (_UINT32_(1) << 6)

#define PIN_PA07B_ADC0_AIN7                        _UINT32_(7) 
#define MUX_PA07B_ADC0_AIN7                        _UINT32_(1) 
#define PINMUX_PA07B_ADC0_AIN7                     ((PIN_PA07B_ADC0_AIN7 << 16) | MUX_PA07B_ADC0_AIN7)
#define PORT_PA07B_ADC0_AIN7                       (_UINT32_(1) << 7)

#define PIN_PA16B_ADC0_AIN16                       _UINT32_(16)
#define MUX_PA16B_ADC0_AIN16                       _UINT32_(1) 
#define PINMUX_PA16B_ADC0_AIN16                    ((PIN_PA16B_ADC0_AIN16 << 16) | MUX_PA16B_ADC0_AIN16)
#define PORT_PA16B_ADC0_AIN16                      (_UINT32_(1) << 16)

#define PIN_PA17B_ADC0_AIN17                       _UINT32_(17)
#define MUX_PA17B_ADC0_AIN17                       _UINT32_(1) 
#define PINMUX_PA17B_ADC0_AIN17                    ((PIN_PA17B_ADC0_AIN17 << 16) | MUX_PA17B_ADC0_AIN17)
#define PORT_PA17B_ADC0_AIN17                      (_UINT32_(1) << 17)

#define PIN_PA18B_ADC0_AIN18                       _UINT32_(18)
#define MUX_PA18B_ADC0_AIN18                       _UINT32_(1) 
#define PINMUX_PA18B_ADC0_AIN18                    ((PIN_PA18B_ADC0_AIN18 << 16) | MUX_PA18B_ADC0_AIN18)
#define PORT_PA18B_ADC0_AIN18                      (_UINT32_(1) << 18)

#define PIN_PA19B_ADC0_AIN19                       _UINT32_(19)
#define MUX_PA19B_ADC0_AIN19                       _UINT32_(1) 
#define PINMUX_PA19B_ADC0_AIN19                    ((PIN_PA19B_ADC0_AIN19 << 16) | MUX_PA19B_ADC0_AIN19)
#define PORT_PA19B_ADC0_AIN19                      (_UINT32_(1) << 19)

#define PIN_PA20B_ADC0_AIN20                       _UINT32_(20)
#define MUX_PA20B_ADC0_AIN20                       _UINT32_(1) 
#define PINMUX_PA20B_ADC0_AIN20                    ((PIN_PA20B_ADC0_AIN20 << 16) | MUX_PA20B_ADC0_AIN20)
#define PORT_PA20B_ADC0_AIN20                      (_UINT32_(1) << 20)

#define PIN_PA21B_ADC0_AIN21                       _UINT32_(21)
#define MUX_PA21B_ADC0_AIN21                       _UINT32_(1) 
#define PINMUX_PA21B_ADC0_AIN21                    ((PIN_PA21B_ADC0_AIN21 << 16) | MUX_PA21B_ADC0_AIN21)
#define PORT_PA21B_ADC0_AIN21                      (_UINT32_(1) << 21)

#define PIN_PA22B_ADC0_AIN22                       _UINT32_(22)
#define MUX_PA22B_ADC0_AIN22                       _UINT32_(1) 
#define PINMUX_PA22B_ADC0_AIN22                    ((PIN_PA22B_ADC0_AIN22 << 16) | MUX_PA22B_ADC0_AIN22)
#define PORT_PA22B_ADC0_AIN22                      (_UINT32_(1) << 22)

#define PIN_PA23B_ADC0_AIN23                       _UINT32_(23)
#define MUX_PA23B_ADC0_AIN23                       _UINT32_(1) 
#define PINMUX_PA23B_ADC0_AIN23                    ((PIN_PA23B_ADC0_AIN23 << 16) | MUX_PA23B_ADC0_AIN23)
#define PORT_PA23B_ADC0_AIN23                      (_UINT32_(1) << 23)

