zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/include/pio/pic32cm6408pl10048.h
#define PIN_PA18H_CCL_IN8                          _UINT32_(18)
#define MUX_PA18H_CCL_IN8                          _UINT32_(7) 
#define PINMUX_PA18H_CCL_IN8                       ((PIN_PA18H_CCL_IN8 << 16) | MUX_PA18H_CCL_IN8)
#define PORT_PA18H_CCL_IN8                         (_UINT32_(1) << 18)

#define PIN_PA24H_CCL_IN9                          _UINT32_(24)
#define MUX_PA24H_CCL_IN9                          _UINT32_(7) 
#define PINMUX_PA24H_CCL_IN9                       ((PIN_PA24H_CCL_IN9 << 16) | MUX_PA24H_CCL_IN9)
#define PORT_PA24H_CCL_IN9                         (_UINT32_(1) << 24)

#define PIN_PA25H_CCL_IN10                         _UINT32_(25)
#define MUX_PA25H_CCL_IN10                         _UINT32_(7) 
#define PINMUX_PA25H_CCL_IN10                      ((PIN_PA25H_CCL_IN10 << 16) | MUX_PA25H_CCL_IN10)
#define PORT_PA25H_CCL_IN10                        (_UINT32_(1) << 25)

#define PIN_PA26H_CCL_IN11                         _UINT32_(26)
#define MUX_PA26H_CCL_IN11                         _UINT32_(7) 
#define PINMUX_PA26H_CCL_IN11                      ((PIN_PA26H_CCL_IN11 << 16) | MUX_PA26H_CCL_IN11)
#define PORT_PA26H_CCL_IN11                        (_UINT32_(1) << 26)

#define PIN_PA03H_CCL_OUT0                         _UINT32_(3) 
#define MUX_PA03H_CCL_OUT0                         _UINT32_(7) 
#define PINMUX_PA03H_CCL_OUT0                      ((PIN_PA03H_CCL_OUT0 << 16) | MUX_PA03H_CCL_OUT0)
#define PORT_PA03H_CCL_OUT0                        (_UINT32_(1) << 3)

#define PIN_PA06H_CCL_OUT0                         _UINT32_(6) 
#define MUX_PA06H_CCL_OUT0                         _UINT32_(7) 
#define PINMUX_PA06H_CCL_OUT0                      ((PIN_PA06H_CCL_OUT0 << 16) | MUX_PA06H_CCL_OUT0)
#define PORT_PA06H_CCL_OUT0                        (_UINT32_(1) << 6)

#define PIN_PA11H_CCL_OUT1                         _UINT32_(11)
#define MUX_PA11H_CCL_OUT1                         _UINT32_(7) 
#define PINMUX_PA11H_CCL_OUT1                      ((PIN_PA11H_CCL_OUT1 << 16) | MUX_PA11H_CCL_OUT1)
#define PORT_PA11H_CCL_OUT1                        (_UINT32_(1) << 11)

#define PIN_PA14H_CCL_OUT1                         _UINT32_(14)
#define MUX_PA14H_CCL_OUT1                         _UINT32_(7) 
#define PINMUX_PA14H_CCL_OUT1                      ((PIN_PA14H_CCL_OUT1 << 16) | MUX_PA14H_CCL_OUT1)
#define PORT_PA14H_CCL_OUT1                        (_UINT32_(1) << 14)

#define PIN_PA19H_CCL_OUT2                         _UINT32_(19)
#define MUX_PA19H_CCL_OUT2                         _UINT32_(7) 
#define PINMUX_PA19H_CCL_OUT2                      ((PIN_PA19H_CCL_OUT2 << 16) | MUX_PA19H_CCL_OUT2)
#define PORT_PA19H_CCL_OUT2                        (_UINT32_(1) << 19)

#define PIN_PA22H_CCL_OUT2                         _UINT32_(22)
#define MUX_PA22H_CCL_OUT2                         _UINT32_(7) 
#define PINMUX_PA22H_CCL_OUT2                      ((PIN_PA22H_CCL_OUT2 << 16) | MUX_PA22H_CCL_OUT2)
#define PORT_PA22H_CCL_OUT2                        (_UINT32_(1) << 22)

#define PIN_PA27H_CCL_OUT3                         _UINT32_(27)
#define MUX_PA27H_CCL_OUT3                         _UINT32_(7) 
#define PINMUX_PA27H_CCL_OUT3                      ((PIN_PA27H_CCL_OUT3 << 16) | MUX_PA27H_CCL_OUT3)
#define PORT_PA27H_CCL_OUT3                        (_UINT32_(1) << 27)

/* =================== PORT definition for EIC peripheral =================== */
#define PIN_PA16A_EIC_EXTINT0                      _UINT32_(16)
#define MUX_PA16A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PA16A_EIC_EXTINT0                   ((PIN_PA16A_EIC_EXTINT0 << 16) | MUX_PA16A_EIC_EXTINT0)
#define PORT_PA16A_EIC_EXTINT0                     (_UINT32_(1) << 16)
#define PIN_PA16A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PA16 External Interrupt Line */

#define PIN_PB00A_EIC_EXTINT0                      _UINT32_(32)
#define MUX_PB00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PB00A_EIC_EXTINT0                   ((PIN_PB00A_EIC_EXTINT0 << 16) | MUX_PB00A_EIC_EXTINT0)
#define PORT_PB00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PB00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PB00 External Interrupt Line */

#define PIN_PA00A_EIC_EXTINT0                      _UINT32_(0) 
#define MUX_PA00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PA00A_EIC_EXTINT0                   ((PIN_PA00A_EIC_EXTINT0 << 16) | MUX_PA00A_EIC_EXTINT0)
#define PORT_PA00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PA00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PA00 External Interrupt Line */

#define PIN_PA17A_EIC_EXTINT1                      _UINT32_(17)
#define MUX_PA17A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PA17A_EIC_EXTINT1                   ((PIN_PA17A_EIC_EXTINT1 << 16) | MUX_PA17A_EIC_EXTINT1)
#define PORT_PA17A_EIC_EXTINT1                     (_UINT32_(1) << 17)
#define PIN_PA17A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PA17 External Interrupt Line */

#define PIN_PB01A_EIC_EXTINT1                      _UINT32_(33)
#define MUX_PB01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PB01A_EIC_EXTINT1                   ((PIN_PB01A_EIC_EXTINT1 << 16) | MUX_PB01A_EIC_EXTINT1)
#define PORT_PB01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PB01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PB01 External Interrupt Line */

#define PIN_PA02A_EIC_EXTINT2                      _UINT32_(2) 
#define MUX_PA02A_EIC_EXTINT2                      _UINT32_(0) 
#define PINMUX_PA02A_EIC_EXTINT2                   ((PIN_PA02A_EIC_EXTINT2 << 16) | MUX_PA02A_EIC_EXTINT2)
#define PORT_PA02A_EIC_EXTINT2                     (_UINT32_(1) << 2)
#define PIN_PA02A_EIC_EXTINT_NUM                   _UINT32_(2)  /* EIC signal: PIN_PA02 External Interrupt Line */

#define PIN_PA18A_EIC_EXTINT2                      _UINT32_(18)
#define MUX_PA18A_EIC_EXTINT2                      _UINT32_(0) 
#define PINMUX_PA18A_EIC_EXTINT2                   ((PIN_PA18A_EIC_EXTINT2 << 16) | MUX_PA18A_EIC_EXTINT2)
#define PORT_PA18A_EIC_EXTINT2                     (_UINT32_(1) << 18)
#define PIN_PA18A_EIC_EXTINT_NUM                   _UINT32_(2)  /* EIC signal: PIN_PA18 External Interrupt Line */

