zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/include/pio/pic32cm6408pl10048.h
#define PIN_PA14C_SERCOM1_PAD0                     _UINT32_(14)
#define MUX_PA14C_SERCOM1_PAD0                     _UINT32_(2) 
#define PINMUX_PA14C_SERCOM1_PAD0                  ((PIN_PA14C_SERCOM1_PAD0 << 16) | MUX_PA14C_SERCOM1_PAD0)
#define PORT_PA14C_SERCOM1_PAD0                    (_UINT32_(1) << 14)

#define PIN_PA20C_SERCOM1_PAD0                     _UINT32_(20)
#define MUX_PA20C_SERCOM1_PAD0                     _UINT32_(2) 
#define PINMUX_PA20C_SERCOM1_PAD0                  ((PIN_PA20C_SERCOM1_PAD0 << 16) | MUX_PA20C_SERCOM1_PAD0)
#define PORT_PA20C_SERCOM1_PAD0                    (_UINT32_(1) << 20)

#define PIN_PA31C_SERCOM1_PAD0                     _UINT32_(31)
#define MUX_PA31C_SERCOM1_PAD0                     _UINT32_(2) 
#define PINMUX_PA31C_SERCOM1_PAD0                  ((PIN_PA31C_SERCOM1_PAD0 << 16) | MUX_PA31C_SERCOM1_PAD0)
#define PORT_PA31C_SERCOM1_PAD0                    (_UINT32_(1) << 31)

#define PIN_PA01D_SERCOM1_PAD1                     _UINT32_(1) 
#define MUX_PA01D_SERCOM1_PAD1                     _UINT32_(3) 
#define PINMUX_PA01D_SERCOM1_PAD1                  ((PIN_PA01D_SERCOM1_PAD1 << 16) | MUX_PA01D_SERCOM1_PAD1)
#define PORT_PA01D_SERCOM1_PAD1                    (_UINT32_(1) << 1)

#define PIN_PA27D_SERCOM1_PAD1                     _UINT32_(27)
#define MUX_PA27D_SERCOM1_PAD1                     _UINT32_(3) 
#define PINMUX_PA27D_SERCOM1_PAD1                  ((PIN_PA27D_SERCOM1_PAD1 << 16) | MUX_PA27D_SERCOM1_PAD1)
#define PORT_PA27D_SERCOM1_PAD1                    (_UINT32_(1) << 27)

#define PIN_PB01D_SERCOM1_PAD1                     _UINT32_(33)
#define MUX_PB01D_SERCOM1_PAD1                     _UINT32_(3) 
#define PINMUX_PB01D_SERCOM1_PAD1                  ((PIN_PB01D_SERCOM1_PAD1 << 16) | MUX_PB01D_SERCOM1_PAD1)
#define PORT_PB01D_SERCOM1_PAD1                    (_UINT32_(1) << 1)

#define PIN_PA11C_SERCOM1_PAD1                     _UINT32_(11)
#define MUX_PA11C_SERCOM1_PAD1                     _UINT32_(2) 
#define PINMUX_PA11C_SERCOM1_PAD1                  ((PIN_PA11C_SERCOM1_PAD1 << 16) | MUX_PA11C_SERCOM1_PAD1)
#define PORT_PA11C_SERCOM1_PAD1                    (_UINT32_(1) << 11)

#define PIN_PA15C_SERCOM1_PAD1                     _UINT32_(15)
#define MUX_PA15C_SERCOM1_PAD1                     _UINT32_(2) 
#define PINMUX_PA15C_SERCOM1_PAD1                  ((PIN_PA15C_SERCOM1_PAD1 << 16) | MUX_PA15C_SERCOM1_PAD1)
#define PORT_PA15C_SERCOM1_PAD1                    (_UINT32_(1) << 15)

#define PIN_PA02D_SERCOM1_PAD2                     _UINT32_(2) 
#define MUX_PA02D_SERCOM1_PAD2                     _UINT32_(3) 
#define PINMUX_PA02D_SERCOM1_PAD2                  ((PIN_PA02D_SERCOM1_PAD2 << 16) | MUX_PA02D_SERCOM1_PAD2)
#define PORT_PA02D_SERCOM1_PAD2                    (_UINT32_(1) << 2)

#define PIN_PA24D_SERCOM1_PAD2                     _UINT32_(24)
#define MUX_PA24D_SERCOM1_PAD2                     _UINT32_(3) 
#define PINMUX_PA24D_SERCOM1_PAD2                  ((PIN_PA24D_SERCOM1_PAD2 << 16) | MUX_PA24D_SERCOM1_PAD2)
#define PORT_PA24D_SERCOM1_PAD2                    (_UINT32_(1) << 24)

#define PIN_PB02D_SERCOM1_PAD2                     _UINT32_(34)
#define MUX_PB02D_SERCOM1_PAD2                     _UINT32_(3) 
#define PINMUX_PB02D_SERCOM1_PAD2                  ((PIN_PB02D_SERCOM1_PAD2 << 16) | MUX_PB02D_SERCOM1_PAD2)
#define PORT_PB02D_SERCOM1_PAD2                    (_UINT32_(1) << 2)

#define PIN_PA08C_SERCOM1_PAD2                     _UINT32_(8) 
#define MUX_PA08C_SERCOM1_PAD2                     _UINT32_(2) 
#define PINMUX_PA08C_SERCOM1_PAD2                  ((PIN_PA08C_SERCOM1_PAD2 << 16) | MUX_PA08C_SERCOM1_PAD2)
#define PORT_PA08C_SERCOM1_PAD2                    (_UINT32_(1) << 8)

#define PIN_PA12C_SERCOM1_PAD2                     _UINT32_(12)
#define MUX_PA12C_SERCOM1_PAD2                     _UINT32_(2) 
#define PINMUX_PA12C_SERCOM1_PAD2                  ((PIN_PA12C_SERCOM1_PAD2 << 16) | MUX_PA12C_SERCOM1_PAD2)
#define PORT_PA12C_SERCOM1_PAD2                    (_UINT32_(1) << 12)

#define PIN_PA22C_SERCOM1_PAD2                     _UINT32_(22)
#define MUX_PA22C_SERCOM1_PAD2                     _UINT32_(2) 
#define PINMUX_PA22C_SERCOM1_PAD2                  ((PIN_PA22C_SERCOM1_PAD2 << 16) | MUX_PA22C_SERCOM1_PAD2)
#define PORT_PA22C_SERCOM1_PAD2                    (_UINT32_(1) << 22)

#define PIN_PA03D_SERCOM1_PAD3                     _UINT32_(3) 
#define MUX_PA03D_SERCOM1_PAD3                     _UINT32_(3) 
#define PINMUX_PA03D_SERCOM1_PAD3                  ((PIN_PA03D_SERCOM1_PAD3 << 16) | MUX_PA03D_SERCOM1_PAD3)
#define PORT_PA03D_SERCOM1_PAD3                    (_UINT32_(1) << 3)

#define PIN_PA25D_SERCOM1_PAD3                     _UINT32_(25)
#define MUX_PA25D_SERCOM1_PAD3                     _UINT32_(3) 
#define PINMUX_PA25D_SERCOM1_PAD3                  ((PIN_PA25D_SERCOM1_PAD3 << 16) | MUX_PA25D_SERCOM1_PAD3)
#define PORT_PA25D_SERCOM1_PAD3                    (_UINT32_(1) << 25)

#define PIN_PB03D_SERCOM1_PAD3                     _UINT32_(35)
#define MUX_PB03D_SERCOM1_PAD3                     _UINT32_(3) 
#define PINMUX_PB03D_SERCOM1_PAD3                  ((PIN_PB03D_SERCOM1_PAD3 << 16) | MUX_PB03D_SERCOM1_PAD3)
#define PORT_PB03D_SERCOM1_PAD3                    (_UINT32_(1) << 3)

#define PIN_PA09C_SERCOM1_PAD3                     _UINT32_(9) 
#define MUX_PA09C_SERCOM1_PAD3                     _UINT32_(2) 
#define PINMUX_PA09C_SERCOM1_PAD3                  ((PIN_PA09C_SERCOM1_PAD3 << 16) | MUX_PA09C_SERCOM1_PAD3)
#define PORT_PA09C_SERCOM1_PAD3                    (_UINT32_(1) << 9)

#define PIN_PA13C_SERCOM1_PAD3                     _UINT32_(13)
#define MUX_PA13C_SERCOM1_PAD3                     _UINT32_(2) 
#define PINMUX_PA13C_SERCOM1_PAD3                  ((PIN_PA13C_SERCOM1_PAD3 << 16) | MUX_PA13C_SERCOM1_PAD3)
#define PORT_PA13C_SERCOM1_PAD3                    (_UINT32_(1) << 13)

#define PIN_PA23C_SERCOM1_PAD3                     _UINT32_(23)
#define MUX_PA23C_SERCOM1_PAD3                     _UINT32_(2) 
#define PINMUX_PA23C_SERCOM1_PAD3                  ((PIN_PA23C_SERCOM1_PAD3 << 16) | MUX_PA23C_SERCOM1_PAD3)
#define PORT_PA23C_SERCOM1_PAD3                    (_UINT32_(1) << 23)

