zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/include/pio/pic32cm6408pl10048.h
/* =================== PORT definition for TC0 peripheral =================== */
#define PIN_PA00E_TC0_WO0                          _UINT32_(0) 
#define MUX_PA00E_TC0_WO0                          _UINT32_(4) 
#define PINMUX_PA00E_TC0_WO0                       ((PIN_PA00E_TC0_WO0 << 16) | MUX_PA00E_TC0_WO0)
#define PORT_PA00E_TC0_WO0                         (_UINT32_(1) << 0)

#define PIN_PA10E_TC0_WO0                          _UINT32_(10)
#define MUX_PA10E_TC0_WO0                          _UINT32_(4) 
#define PINMUX_PA10E_TC0_WO0                       ((PIN_PA10E_TC0_WO0 << 16) | MUX_PA10E_TC0_WO0)
#define PORT_PA10E_TC0_WO0                         (_UINT32_(1) << 10)

#define PIN_PA01E_TC0_WO1                          _UINT32_(1) 
#define MUX_PA01E_TC0_WO1                          _UINT32_(4) 
#define PINMUX_PA01E_TC0_WO1                       ((PIN_PA01E_TC0_WO1 << 16) | MUX_PA01E_TC0_WO1)
#define PORT_PA01E_TC0_WO1                         (_UINT32_(1) << 1)

#define PIN_PA11E_TC0_WO1                          _UINT32_(11)
#define MUX_PA11E_TC0_WO1                          _UINT32_(4) 
#define PINMUX_PA11E_TC0_WO1                       ((PIN_PA11E_TC0_WO1 << 16) | MUX_PA11E_TC0_WO1)
#define PORT_PA11E_TC0_WO1                         (_UINT32_(1) << 11)

/* =================== PORT definition for TC1 peripheral =================== */
#define PIN_PA02E_TC1_WO0                          _UINT32_(2) 
#define MUX_PA02E_TC1_WO0                          _UINT32_(4) 
#define PINMUX_PA02E_TC1_WO0                       ((PIN_PA02E_TC1_WO0 << 16) | MUX_PA02E_TC1_WO0)
#define PORT_PA02E_TC1_WO0                         (_UINT32_(1) << 2)

#define PIN_PA08E_TC1_WO0                          _UINT32_(8) 
#define MUX_PA08E_TC1_WO0                          _UINT32_(4) 
#define PINMUX_PA08E_TC1_WO0                       ((PIN_PA08E_TC1_WO0 << 16) | MUX_PA08E_TC1_WO0)
#define PORT_PA08E_TC1_WO0                         (_UINT32_(1) << 8)

#define PIN_PA03E_TC1_WO1                          _UINT32_(3) 
#define MUX_PA03E_TC1_WO1                          _UINT32_(4) 
#define PINMUX_PA03E_TC1_WO1                       ((PIN_PA03E_TC1_WO1 << 16) | MUX_PA03E_TC1_WO1)
#define PORT_PA03E_TC1_WO1                         (_UINT32_(1) << 3)

#define PIN_PA09E_TC1_WO1                          _UINT32_(9) 
#define MUX_PA09E_TC1_WO1                          _UINT32_(4) 
#define PINMUX_PA09E_TC1_WO1                       ((PIN_PA09E_TC1_WO1 << 16) | MUX_PA09E_TC1_WO1)
#define PORT_PA09E_TC1_WO1                         (_UINT32_(1) << 9)

/* =================== PORT definition for TC2 peripheral =================== */
#define PIN_PA20E_TC2_WO0                          _UINT32_(20)
#define MUX_PA20E_TC2_WO0                          _UINT32_(4) 
#define PINMUX_PA20E_TC2_WO0                       ((PIN_PA20E_TC2_WO0 << 16) | MUX_PA20E_TC2_WO0)
#define PORT_PA20E_TC2_WO0                         (_UINT32_(1) << 20)

#define PIN_PA21E_TC2_WO1                          _UINT32_(21)
#define MUX_PA21E_TC2_WO1                          _UINT32_(4) 
#define PINMUX_PA21E_TC2_WO1                       ((PIN_PA21E_TC2_WO1 << 16) | MUX_PA21E_TC2_WO1)
#define PORT_PA21E_TC2_WO1                         (_UINT32_(1) << 21)

/* ================== PORT definition for TCC0 peripheral =================== */
#define PIN_PA00F_TCC0_WO0                         _UINT32_(0) 
#define MUX_PA00F_TCC0_WO0                         _UINT32_(5) 
#define PINMUX_PA00F_TCC0_WO0                      ((PIN_PA00F_TCC0_WO0 << 16) | MUX_PA00F_TCC0_WO0)
#define PORT_PA00F_TCC0_WO0                        (_UINT32_(1) << 0)

#define PIN_PA08F_TCC0_WO0                         _UINT32_(8) 
#define MUX_PA08F_TCC0_WO0                         _UINT32_(5) 
#define PINMUX_PA08F_TCC0_WO0                      ((PIN_PA08F_TCC0_WO0 << 16) | MUX_PA08F_TCC0_WO0)
#define PORT_PA08F_TCC0_WO0                        (_UINT32_(1) << 8)

#define PIN_PA16F_TCC0_WO0                         _UINT32_(16)
#define MUX_PA16F_TCC0_WO0                         _UINT32_(5) 
#define PINMUX_PA16F_TCC0_WO0                      ((PIN_PA16F_TCC0_WO0 << 16) | MUX_PA16F_TCC0_WO0)
#define PORT_PA16F_TCC0_WO0                        (_UINT32_(1) << 16)

#define PIN_PA24F_TCC0_WO0                         _UINT32_(24)
#define MUX_PA24F_TCC0_WO0                         _UINT32_(5) 
#define PINMUX_PA24F_TCC0_WO0                      ((PIN_PA24F_TCC0_WO0 << 16) | MUX_PA24F_TCC0_WO0)
#define PORT_PA24F_TCC0_WO0                        (_UINT32_(1) << 24)

#define PIN_PB00F_TCC0_WO0                         _UINT32_(32)
#define MUX_PB00F_TCC0_WO0                         _UINT32_(5) 
#define PINMUX_PB00F_TCC0_WO0                      ((PIN_PB00F_TCC0_WO0 << 16) | MUX_PB00F_TCC0_WO0)
#define PORT_PB00F_TCC0_WO0                        (_UINT32_(1) << 0)

#define PIN_PB08F_TCC0_WO0                         _UINT32_(40)
#define MUX_PB08F_TCC0_WO0                         _UINT32_(5) 
#define PINMUX_PB08F_TCC0_WO0                      ((PIN_PB08F_TCC0_WO0 << 16) | MUX_PB08F_TCC0_WO0)
#define PORT_PB08F_TCC0_WO0                        (_UINT32_(1) << 8)

#define PIN_PA01F_TCC0_WO1                         _UINT32_(1) 
#define MUX_PA01F_TCC0_WO1                         _UINT32_(5) 
#define PINMUX_PA01F_TCC0_WO1                      ((PIN_PA01F_TCC0_WO1 << 16) | MUX_PA01F_TCC0_WO1)
#define PORT_PA01F_TCC0_WO1                        (_UINT32_(1) << 1)

#define PIN_PA09F_TCC0_WO1                         _UINT32_(9) 
#define MUX_PA09F_TCC0_WO1                         _UINT32_(5) 
#define PINMUX_PA09F_TCC0_WO1                      ((PIN_PA09F_TCC0_WO1 << 16) | MUX_PA09F_TCC0_WO1)
#define PORT_PA09F_TCC0_WO1                        (_UINT32_(1) << 9)

#define PIN_PA17F_TCC0_WO1                         _UINT32_(17)
#define MUX_PA17F_TCC0_WO1                         _UINT32_(5) 
#define PINMUX_PA17F_TCC0_WO1                      ((PIN_PA17F_TCC0_WO1 << 16) | MUX_PA17F_TCC0_WO1)
#define PORT_PA17F_TCC0_WO1                        (_UINT32_(1) << 17)

